In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
# using pd.Index allows naming indices/columns
dframe1 = DataFrame(np.arange(8).reshape(2, 4),
                   index = pd.Index(["SF", "LA"], name = "city"),
                   columns = pd.Index(["A", "B", "C", "D"], name = "letters"))
dframe1

letters  A  B  C  D
city
SF       0  1  2  3
LA       4  5  6  7

In [7]:
dframe_st = dframe1.stack()
dframe_st

city  letters
SF    A          0
      B          1
      C          2
      D          3
LA    A          4
      B          5
      C          6
      D          7
dtype: int32

In [9]:
dframe_st.unstack()

letters  A  B  C  D
city
SF       0  1  2  3
LA       4  5  6  7

In [11]:
dframe_st.unstack("city")

city     SF  LA
letters
A         0   4
B         1   5
C         2   6
D         3   7

In [15]:
ser1 = Series([0, 1, 2], index = ["Q", "X", "Y"])
ser2 = Series([4, 5, 6], index = ["X", "Y", "Z"])

In [19]:
dframe1 = pd.concat([ser1, ser2], keys = ["Alpha", "Beta"])
dframe1

Alpha  Q    0
       X    1
       Y    2
Beta   X    4
       Y    5
       Z    6
dtype: int64

In [21]:
dframe1.unstack()

         Q    X    Y    Z
Alpha  0.0  1.0  2.0  NaN
Beta   NaN  4.0  5.0  6.0

In [23]:
dframe1.unstack().stack()

Alpha  Q    0.0
       X    1.0
       Y    2.0
Beta   X    4.0
       Y    5.0
       Z    6.0
dtype: float64

In [29]:
dframe1 = dframe1.unstack()

In [31]:
dframe1

   Alpha  Beta
Q    0.0   NaN
X    1.0   4.0
Y    2.0   5.0
Z    NaN   6.0

In [35]:
# dframe1.stack() will now remove null values. To keep them, see below
dframe1.stack(dropna = False)

C:\Users\jfhar\AppData\Local\Temp\ipykernel_9712\776943015.py:2: FutureWarning: The previous implementation of stack is deprecated and will be removed in a future version of pandas. See the What's New notes for pandas 2.1.0 for details. Specify future_stack=True to adopt the new implementation and silence this warning.
  dframe1.stack(dropna = False)

Q  Alpha    0.0
   Beta     NaN
X  Alpha    1.0
   Beta     4.0
Y  Alpha    2.0
   Beta     5.0
Z  Alpha    NaN
   Beta     6.0
dtype: float64